In [9]:
# following clean up task is done
#     - rename columns
#     - drop not needed columns 'director_name'
#     - handle null (nan) data for 'duration'
#     - handle duplicated rows
#     - change columns data 'title_year' and 'movie_title'
#     - reset index to 'movie_title'

In [1]:
# import library and load data

# Rename columns

In [2]:
# put all columns name to lower case, then replace ' ' with '_'

# Drop columns

In [3]:
# drop column 'director_name'
# explain 'inplace' parameter

# Handle missing data

In [4]:
# detect and count missing data
# counting number of missing (null) data in each columns
# isnull() return true or false

In [5]:
# sum() on true, false table will return total count of null

In [6]:
# recheck the rows which missing data with filter to show null rows

In [7]:
# method 1 : want to remove entire missing data
# use notnull()
# or use isnull()
# recheck after remove all missing data row

In [8]:
# method 2 : fill missing data
# calculate the mean
# fill null value with mean, inplace mean the change affect right with df_imdb
# check no have any null value remain after fill

# Handle duplicate data

In [9]:
# detect duplicate data

In [10]:
# count duplicate data

In [11]:
# reconfirm duplicate by show it on dataset

In [12]:
# remove duplicated

# Change column data

In [13]:
# remove .0 from data inside column 'title_year'
# note that if still have NAN value, apply will not work

In [ ]:
# remove space at end of movie_title

# Set index column

In [256]:
# now movie_title is unique, so I want to set it as index
df_imdb.set_index('movie_title', inplace=True)
df_imdb.head()

                                          duration  title_year
movie_title
Avatar                                       178.0        2009
Pirates of the Caribbean: At World's End     169.0        2007
Spectre                                      148.0        2015
The Dark Knight Rises                        164.0        2012
John Carter                                  132.0        2012

In [257]:
# try to access data with movie_title index
df_imdb.loc['Avatar','duration']

178.0